# Dockerfile

# استفاده از ایمیج پایه پایتون 3.11-slim
FROM python:3.11-slim

# تنظیم متغیر محیطی برای جلوگیری از بافرینگ خروجی پایتون
ENV PYTHONUNBUFFERED 1

# تنظیم دایرکتوری کاری داخل کانتینر
WORKDIR /app

# کپی کردن فایل نیازمندی‌ها و نصب وابستگی‌ها
COPY ./requirements.txt /app/
RUN pip install --no-cache-dir -r requirements.txt

# کپی کردن کد سورس برنامه
# نکته مهم: برای اجبار به بازسازی لایه COPY
# باید مطمئن شویم که هیچ خطای دیگری در زمان import شدن کد وجود ندارد.
# این کامنت فقط برای اطمینان از خروج از کش داکر در این مرحله مهم اضافه شده است.
# کپی کردن پوشه src
COPY ./src /app/src

# تعریف دستوری که در زمان اجرای کانتینر اجرا می‌شود
CMD ["uvicorn", "src.main:app", "--host", "0.0.0.0", "--port", "8000"]
